package D_0712;

import java.util.Random;

//************************************************************
//1번 실습
//public class Test02 {
//	public static void main(String[] args) {
//		
//		// for문을 잘못사용하는 예시
//		// 더이상 변형, 활용, 응용이 불가능한 for문
//		for(int i = 5 ; i < 9 ; ++i) {
//			System.out.println(i);
//		}
//		
//		// for문은 항상 0부터 시작하도록 작성하라.
//		int s = 5, e = 8;
//		int size = e-s+1; // 출력될 마지막 숫자 - 출력될 처음 숫자 +1
//		for(int i = 0 ; i < size ; ++i) {  
//			System.out.println(5+i);
//		}
//		
//		//************************************************************
//		// 스코프 생략 된 경우->한문장일경우
//		int i = 0;
//		for(i = 0 ; i < 5 ; ++i); // 일종의 슈가 코드, 문법적으로 알고 있기
//		System.out.println(i+10);
//		
//		//************************************************************
//		
//		
//		
//	}
//}



